; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   orange_block_1 white_block_1 red_block_1 orange_block_2 black_block_1 green_block_1 red_block_2 - block
 )
 (:init (ontable orange_block_1) (ontable white_block_1) (on red_block_1 orange_block_1) (on orange_block_2 white_block_1) (on black_block_1 red_block_1) (on green_block_1 orange_block_2) (ontable red_block_2) (clear black_block_1) (clear green_block_1) (clear red_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on orange_block_2 black_block_1)))
 (:constraints (sometime (not (ontable black_block_1))) (sometime-after (not (ontable black_block_1)) (clear red_block_1)) (sometime (clear white_block_1)) (sometime-before (clear white_block_1) (clear orange_block_1)) (sometime (holding orange_block_1)) (sometime (on orange_block_1 white_block_1)) (sometime (holding orange_block_2)) (sometime-before (holding orange_block_2) (on red_block_1 green_block_1)) (sometime (holding green_block_1)) (sometime-after (holding green_block_1) (or (on red_block_2 orange_block_1) (on orange_block_1 black_block_1))) (sometime (not (on black_block_1 white_block_1))) (sometime-after (not (on black_block_1 white_block_1)) (clear red_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_1 red_block_1)
   deleted: (on black_block_1 red_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear red_block_1)
   goals met: 0 of 1
2. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 1
3. (unstack green_block_1 orange_block_2)
   deleted: (on green_block_1 orange_block_2) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear orange_block_2)
   goals met: 0 of 1
4. (putdown green_block_1)
   deleted: (holding green_block_1)
   added: (clear green_block_1) (handempty) (ontable green_block_1)
   goals met: 0 of 1
5. (unstack red_block_1 orange_block_1)
   deleted: (on red_block_1 orange_block_1) (clear red_block_1) (handempty)
   added: (holding red_block_1) (clear orange_block_1)
   goals met: 0 of 1
6. (stack red_block_1 green_block_1)
   deleted: (clear green_block_1) (holding red_block_1)
   added: (handempty) (clear red_block_1) (on red_block_1 green_block_1)
   goals met: 0 of 1
7. (pickup orange_block_1)
   deleted: (clear orange_block_1) (ontable orange_block_1) (handempty)
   added: (holding orange_block_1)
   goals met: 0 of 1
8. (stack orange_block_1 black_block_1)
   deleted: (clear black_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 black_block_1)
   goals met: 0 of 1
9. (unstack orange_block_2 white_block_1)
   deleted: (on orange_block_2 white_block_1) (clear orange_block_2) (handempty)
   added: (holding orange_block_2) (clear white_block_1)
   goals met: 0 of 1
10. (putdown orange_block_2)
   deleted: (holding orange_block_2)
   added: (clear orange_block_2) (handempty) (ontable orange_block_2)
   goals met: 0 of 1
11. (unstack orange_block_1 black_block_1)
   deleted: (on orange_block_1 black_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear black_block_1)
   goals met: 0 of 1
12. (stack orange_block_1 white_block_1)
   deleted: (clear white_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 white_block_1)
   goals met: 0 of 1
13. (pickup orange_block_2)
   deleted: (clear orange_block_2) (ontable orange_block_2) (handempty)
   added: (holding orange_block_2)
   goals met: 0 of 1
14. (stack orange_block_2 black_block_1)
   deleted: (clear black_block_1) (holding orange_block_2)
   added: (handempty) (clear orange_block_2) (on orange_block_2 black_block_1)
   goals met: 1 of 1
